snlkuharlocal/src/DataProcessors/ОбработатьУведомленияОбОстатках/ОбработатьУведомленияОбОстатках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработатьУведомленияОбОстатках</name>
</mdclass:DataProcessor>

snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/РезервыТМЦ/РезервыТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ПредварительныйЗаказКлиента</types>
      <types>DocumentRef.ПродажаИМ</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ВиртуальныйРезерв</types>
      <types>DocumentRef.ЗаявкаНаПерепаковку</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаEUR</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.КорректировкаКонтрактаСПроизводителем</types>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаявкаНаПроизводство</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контракт</name>
    <type>
      <types>CatalogRef.КонтрактыСПроизводителем</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/ТоварыВПути/ТоварыВПути.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВПути</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПоставщика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/УведомлениеОбОстатках/УведомлениеОбОстатках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОбОстатках</name>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Остатки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/ОбработатьУведомленияОбОстатках/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	
	ДатаОстатков = ТекущаяДатаСеанса();
	
	Если ТаблицаПараметров <> Неопределено Тогда
		
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
		
			Если СтрокаТП.Имя = "ДатаОстатков" Тогда
				ДатаОстатков = ?(ЗначениеЗаполнено(СтрокаТП.Значение), СтрокаТП.Значение, ТекущаяДатаСеанса());
			КонецЕсли;
		
		КонецЦикла;
		                      
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ДатаОстатков);		 
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УведомлениеОбОстатках.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УведомлениеОбОстатках КАК УведомлениеОбОстатках
	|ГДЕ
	|	НЕ УведомлениеОбОстатках.ПометкаУдаления
	|	И НЕ УведомлениеОбОстатках.Отменен";
	
	ЗаписатьВЛог("ОбработатьУведомленияОбОстатках", "Начинаю исполнение " + Строка(ДатаОстатков),"Информация");
	
	УстановитьПривилегированныйРежим(Истина);
	МассивРегистраторов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Остатки.Количество, 0) КАК МинимальноеКоличество,
	|	ЕСТЬNULL(ОстаткиТМЦ.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦ.КоличествоОстаток, 0) КАК СвободныйОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиТМЦ.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦ.КоличествоОстаток, 0) < ЕСТЬNULL(Остатки.Количество, 0)
	|			ТОГДА ЕСТЬNULL(Остатки.Количество, 0) - (ЕСТЬNULL(ОстаткиТМЦ.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦ.КоличествоОстаток, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Нехватка
	|ПОМЕСТИТЬ ОсновнаяТаблица
	|ИЗ
	|	Документ.УведомлениеОбОстатках.Остатки КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(
	|				&Период,
	|				Склад В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							Склады.Склад КАК Склад
	|						ИЗ
	|							Документ.УведомлениеОбОстатках.Склады КАК Склады
	|						ГДЕ
	|							Склады.Ссылка = &Ссылка)
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							Остатки.Номенклатура КАК Номенклатура
	|						ИЗ
	|							Документ.УведомлениеОбОстатках.Остатки КАК Остатки
	|						ГДЕ
	|							Остатки.Ссылка = &Ссылка)) КАК ОстаткиТМЦ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|					&Период,
	|					Склад В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								Склады.Склад КАК Склад
	|							ИЗ
	|								Документ.УведомлениеОбОстатках.Склады КАК Склады
	|							ГДЕ
	|								Склады.Ссылка = &Ссылка)
	|						И Номенклатура В
	|							(ВЫБРАТЬ
	|								Остатки.Номенклатура КАК Номенклатура
	|							ИЗ
	|								Документ.УведомлениеОбОстатках.Остатки КАК Остатки
	|							ГДЕ
	|								Остатки.Ссылка = &Ссылка)) КАК РезервыТМЦ
	|			ПО ОстаткиТМЦ.Номенклатура = РезервыТМЦ.Номенклатура
	|		ПО Остатки.Номенклатура = ОстаткиТМЦ.Номенклатура
	|ГДЕ
	|	Остатки.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(ЗаказыПоставщикамОстатки.КоличествоОстаток, 0)) КАК ВПроизводстве
	|ПОМЕСТИТЬ Производство
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|			&Период,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					Остатки.Номенклатура КАК Номенклатура
	|				ИЗ
	|					Документ.УведомлениеОбОстатках.Остатки КАК Остатки
	|				ГДЕ
	|					Остатки.Ссылка = &Ссылка)) КАК ЗаказыПоставщикамОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонтрактСПроизводителем.Товары КАК Товары
	|		ПО ЗаказыПоставщикамОстатки.Заказ = Товары.Ссылка
	|			И ЗаказыПоставщикамОстатки.Номенклатура = Товары.Номенклатура
	|			И (ТИПЗНАЧЕНИЯ(ЗаказыПоставщикамОстатки.Заказ) = ТИП(Документ.КонтрактСПроизводителем))
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстатки.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(ЗаказыПоставщикамОстатки.КоличествоОстаток, 0)) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(ЗаказыПоставщикамОстатки.КоличествоОстаток, 0)) КАК НаСогласованииЦены
	|ПОМЕСТИТЬ ТоварыНаСогласованииЦены
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|			&Период,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					Остатки.Номенклатура КАК Номенклатура
	|				ИЗ
	|					Документ.УведомлениеОбОстатках.Остатки КАК Остатки
	|				ГДЕ
	|					Остатки.Ссылка = &Ссылка)) КАК ЗаказыПоставщикамОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаПроизводство.Товары КАК Товары
	|		ПО ЗаказыПоставщикамОстатки.Заказ = Товары.Ссылка
	|			И ЗаказыПоставщикамОстатки.Номенклатура = Товары.Номенклатура
	|			И (ТИПЗНАЧЕНИЯ(ЗаказыПоставщикамОстатки.Заказ) = ТИП(Документ.ЗаявкаНаПроизводство))
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстатки.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(ЗаказыПоставщикамОстатки.КоличествоОстаток, 0)) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВПути.Номенклатура КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(ВПути.КоличествоОстаток, 0)) КАК ВПути
	|ПОМЕСТИТЬ ТоварыВПути
	|ИЗ
	|	РегистрНакопления.ТоварыВПути.Остатки(
	|			&Период,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					Остатки.Номенклатура КАК Номенклатура
	|				ИЗ
	|					Документ.УведомлениеОбОстатках.Остатки КАК Остатки
	|				ГДЕ
	|					Остатки.Ссылка = &Ссылка)) КАК ВПути
	|
	|СГРУППИРОВАТЬ ПО
	|	ВПути.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(ВПути.КоличествоОстаток, 0)) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОсновнаяТаблица.Номенклатура, ЕСТЬNULL(Производство.Номенклатура, ЕСТЬNULL(мТоварыНаСогласованииЦены.Номенклатура, ТоварыВПути.Номенклатура))) КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(ОсновнаяТаблица.МинимальноеКоличество, 0)) КАК МинимальноеКоличество,
	|	СУММА(ЕСТЬNULL(ОсновнаяТаблица.СвободныйОстаток, 0)) КАК СвободныйОстаток,
	|	СУММА(ЕСТЬNULL(мТоварыНаСогласованииЦены.НаСогласованииЦены, 0)) КАК НаСогласованииЦены,
	|	СУММА(ЕСТЬNULL(Производство.ВПроизводстве, 0)) КАК ВПроизводстве,
	|	СУММА(ЕСТЬNULL(ТоварыВПути.ВПути, 0)) КАК ВПути,
	|	ВЫБОР
	|		КОГДА СУММА(ЕСТЬNULL(ОсновнаяТаблица.МинимальноеКоличество, 0)) - СУММА(ЕСТЬNULL(ОсновнаяТаблица.СвободныйОстаток, 0)) - СУММА(ЕСТЬNULL(мТоварыНаСогласованииЦены.НаСогласованииЦены, 0)) - СУММА(ЕСТЬNULL(Производство.ВПроизводстве, 0)) - СУММА(ЕСТЬNULL(ТоварыВПути.ВПути, 0)) > 0
	|			ТОГДА СУММА(ЕСТЬNULL(ОсновнаяТаблица.МинимальноеКоличество, 0)) - СУММА(ЕСТЬNULL(ОсновнаяТаблица.СвободныйОстаток, 0)) - СУММА(ЕСТЬNULL(мТоварыНаСогласованииЦены.НаСогласованииЦены, 0)) - СУММА(ЕСТЬNULL(Производство.ВПроизводстве, 0)) - СУММА(ЕСТЬNULL(ТоварыВПути.ВПути, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РекомендованныйЗаказ
	|ИЗ
	|	ОсновнаяТаблица КАК ОсновнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Производство КАК Производство
	|		ПО ОсновнаяТаблица.Номенклатура = Производство.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыНаСогласованииЦены КАК мТоварыНаСогласованииЦены
	|		ПО ОсновнаяТаблица.Номенклатура = мТоварыНаСогласованииЦены.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыВПути КАК ТоварыВПути
	|		ПО ОсновнаяТаблица.Номенклатура = ТоварыВПути.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ОсновнаяТаблица.Номенклатура, ЕСТЬNULL(Производство.Номенклатура, ЕСТЬNULL(мТоварыНаСогласованииЦены.Номенклатура, ТоварыВПути.Номенклатура)))
	|
	|ИМЕЮЩИЕ
	|	ВЫБОР
	|		КОГДА СУММА(ЕСТЬNULL(ОсновнаяТаблица.МинимальноеКоличество, 0)) - СУММА(ЕСТЬNULL(ОсновнаяТаблица.СвободныйОстаток, 0)) - СУММА(ЕСТЬNULL(мТоварыНаСогласованииЦены.НаСогласованииЦены, 0)) - СУММА(ЕСТЬNULL(Производство.ВПроизводстве, 0)) - СУММА(ЕСТЬNULL(ТоварыВПути.ВПути, 0)) > 0
	|			ТОГДА СУММА(ЕСТЬNULL(ОсновнаяТаблица.МинимальноеКоличество, 0)) - СУММА(ЕСТЬNULL(ОсновнаяТаблица.СвободныйОстаток, 0)) - СУММА(ЕСТЬNULL(мТоварыНаСогласованииЦены.НаСогласованииЦены, 0)) - СУММА(ЕСТЬNULL(Производство.ВПроизводстве, 0)) - СУММА(ЕСТЬNULL(ТоварыВПути.ВПути, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ > 0";
	
	Для Каждого Регистратор Из МассивРегистраторов Цикл
		
		Запрос.УстановитьПараметр("Ссылка", Регистратор);
		
		УстановитьПривилегированныйРежим(Истина);
		ОсновнаяТаблица = Запрос.Выполнить().Выгрузить();
		УстановитьПривилегированныйРежим(Ложь);
		
		СписокПолучателей = Новый СписокЗначений;
		Для Каждого Получатель ИЗ Регистратор.Получатели Цикл
			Если ЗначениеЗаполнено(Получатель.ФизЛицо.ЕМэйл) Тогда
				СписокПолучателей.Добавить(Получатель.ФизЛицо.ЕМэйл);	
			КонецЕсли;
		КонецЦикла;			
		
		Если ОсновнаяТаблица.Количество() > 0 И СписокПолучателей.Количество() > 0 Тогда
			ТекстТаблицы = ПреобразоватьПростуюТаблицуВHTMLText(ОсновнаяТаблица,"Рекомендованный Заказ в документе " + Строка(Регистратор));
			СформироватьВнутреннееУведомление(СписокПолучателей, ТекстТаблицы, "Рекомендованный Заказ в документе " + Строка(Регистратор), Регистратор,);	
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписатьВЛог("ОбработатьУведомленияОбОстатках", "Завершаю исполнение " + Строка(ДатаОстатков),"Информация");
	
КонецПроцедуры

//Кухарь 15.01.19 начало
Функция ПреобразоватьПростуюТаблицуВHTMLText(ТЗ,ДопТекст) 

	Ответ = "<HTML><HEAD><BODY>"+ДопТекст+"<TABLE border=1><TBODY>";
	
	//Для каждого СтрокаТаблицы из ТЗ	цикл
		Ответ = Ответ + "<TR>";
		Для каждого Колонка из ТЗ.колонки цикл
			Ответ=Ответ+"<TD><P><FONT size=3>" + Колонка.имя +"</FONT></P></TD>";
		КонецЦикла;
		Ответ=Ответ+"</TR>";
	//КонецЦикла;
	
	Для каждого СтрокаТаблицы из ТЗ	цикл
		Ответ=Ответ+"<TR>";
		Для каждого Колонка из ТЗ.колонки цикл
			Ответ=Ответ+"<TD><P><FONT size=3>" + СтрокаТаблицы[Колонка.имя]+"</FONT></P></TD>";
		КонецЦикла;
		Ответ=Ответ+"</TR>";
	КонецЦикла;
	
	Ответ = Ответ + "</TBODY></TABLE></BODY></HTML>";
	Возврат Ответ;
	
КонецФункции
//Кухарь 15.01.19 конец
